docs/aum/doc.org
#+TITLE: #+OPTIONS: toc:4
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="stylesheet.css" />

* Getting started
** Useful docs to read first
*** React
 https://reactjs.org/docs/getting-started.html

 Om-next is built on react. Om-next components are basically classical react
 components with a layer over them so om-next can do it's own optimisations and
 control the render cycle. But just like in react you have access to the various
 lifecycle hooks (but leave shouldComponentUpdate alone, this is managed by
 om-next). You pass in props to subcomponents and components can have their own
 local state. Basically om-next generates a tree of data from the app-state by
 applying the root query of the app over it every time a transact is done or a
 merge of data with app-state (in the reconciler for instance when data is
 returned and the callback invoked with it). This data is then supplied to the
 root component and the new ui state calculated and rendered. Which is then
 static till the next transaction or merge. This sounds rather inefficient, but
 the way React is designed it's not in practice. Also om-next itself won't even
 ask React to re-render a component if it decides that the props that are passed
 to it haven't changed from the last time it was rendered.
*** Om-next
[[https://github.com/omcljs/om/wiki/Documentation-(om.next)][https://github.com/omcljs/om/wiki/Documentation-(om.next)]]
*** Fulcro handbook
 http://book.fulcrologic.com/
 Most of it is about how om-next itself works. The solutions for a more practical
 om-next are a bit different, and in some ways diverge somewhat from the 'om-next
 way' of doing things.
*** See om-next docs for more useful links
 Such as for graphql, falcor, datomic etc.

 "Om-next by leveraging lisp and immutable values combines the best ideas of
 graphql and falcor in a less cumbersome and more flexible manner."

** Install
To pull in all the tools and libs to build an aum app add

 #+BEGIN_SRC clojure
`````clojure
aum {:git/url "https://github.com/michieljoris/aum.git",
     :sha "577daf362c3f81e08d43f654ef0bbf3ddc93e015"
     :tag "master"},
````
#+END_SRC

to your dependencies.

To actually build an app it's a good idea to start with a minimal setup, see the
following section.

** Starter app

TODO-doc: add github link to aum-starter-app

There is a repo that's an app using aum libs, but has minimal content. This can
be used to try out building features/pages.

Clone it and follow the following instructions.

*** Install
Prerequisites:

- mysql
- node
- nvm
- java 1.7 or greater

[[https://clojure.org/guides/getting_started][Install clojure]]

In the starter repo do:

    nvm install
    nvm use

to make sure the proper version of node is used.

And then:

    bin/dev-install

For development also do this:

    Make sure pagora.aum, pagora.clj-utils and pagora.revolt repos are in the same parent dir as this repo.

    So if this repo is in ~/src/aum-starter-app for example, then you should
    also have for instance ~/src/aum  checked out to the most recent master.

TODO-aum: get this working properly!!!
    This is so that tools.deps can resolve the dependencies locally. If you
    want deps from github replace local-deps with git-deps in the bin/dev-backend script

*** Run in development mode

It's practical to run backend and frontend separately. It's rare you need
restart both, but being able to restarting one or the other sometimes is useful.
Also sometimes you only need or want to work on the backend.

After bin/dev-install:

    bin/dev-backend

which will get you a clj repl in the terminal and an nrepl server.

To set config settings, for example the db, do:

    DB_NAME=chinchilla bin/dev-backend

See config.clj for possible settings and their defaults (replace
hyphens with underscores and upcase the config key).

Connect your editor's repl to the nrepl server at port 5700.

In dev mode src-dev/clj/user.clj gets loaded (see resources/revolt.edn under the
revolt.plugin/rebel key). In deps.edn src-dev should be included in a paths
vector.

The sexpr (restart) is uncommented in that ns so it will be executed which will
(re)start the backend app.

To compile the frontend, in another terminal do:

    bin/dev-frontend

which will get you a cljs repl in your terminal.

See app at localhost:8080/app

TODO-doc: test and document cljs repl
# In the nrepl session in your editor run (user/cljs-repl) for a cljs repl

# You might have to uncomment the connect-to-cljs-repl defn in
# src/dev/cljs/cljs/user.cljs first.

Alternatively start figwheel repl in emacs when running cider:
cider-jack-in-cljs (SPACE-m-" in Doom emacs).


Entry point of backend in development is at clj.user ns. It has the lifecycle methods.

Entry point of frontend is at app.frontend.core. The aum/init fn initializes a
websocket and starts it. The react component tree gets mounted after websocket first
open event is received.

NOTE: after building a prod jar, restart both backend and figwheel processes.
This is because the out dir is cleaned before building and the dev versions of both css and js
need to be built again. Or try modify a scss file and a cljs file to
kickstart recompile.

