docs/aum/doc.org
*** Run in production mode

TODO-aum: the build task doesn't include deps in aliases into the uberjar. Need to
fix the build task, so to create an uberjar uncomment the pagora.aum, pagora.revolt and
pagora.clj-utils deps in deps.edn.

Build production jar at dist/app.jar with:

    bin/prod-build

This'll fetch node modules and build the js bundle as well.

Set db user/password/url/db-name, server port and ip, and what logs you would
like by setting the various environment variables and run jar (in dist dir):

TODO-aum: test starter app prod jar!!!
    CLJ_ENV=prod DB_USER=test DB_PASSWORD=abc DB_URL="//localhost:3306/" DB_NAME=chinchilla_development QUERY_LOG=true SQL_LOG=true HTTP_LOG=false SERVER_PORT=8081 SERVER_IP=0.0.0.0 NEW_RELIC_LICENSE_KEY="<some newrelic key>" java -javaagent:./newrelic-agent.jar -Dnewrelic.config.file=./newrelic.yml   -Dnewrelic.environment=production -jar dist/aum.jarlk

or just

    bin/prod-run

Or all in one cmd:

    bin/prod-build-and-run

If tools.deps complains about dirs already existing when cloning repos delete ~/.gitlibs

Clearing classpath cache in ~/.clojure might also help.

See app at http://localhost:8090

Entry point of backend in production is at app.core (the -main fn).

* Core concepts
** It's om-next.
The idea is to stay as close as possible to the original idea of om-next as just
a thin layer on the top of react, but extend some concepts so at the very least
a straightforward crud app can be built really simply and quickly, with simple
tools to facilitate both front and backends development.

Om-next itself is isomorphic, meaning it can ran on either front or backend. Aum
extends om-next, and some of it can be used on both front and backend, but in
general it focuses more on making om-next useful in a practical way. So in the
backend the om-next parser is implemented to query a mysql database, with
security and validation mechanisms.

On the frontend aum implements a parser that in most cases will do the
right thing in denormalizing queries over the app state. And there are mechanism
for dealing with multiple remotes, websockets, error handling, correcting
optimistic updates etc.

Aum has its own thin layers over the reconciler and parser but still uses defui,
om/transact! etc

* Build system
TODO-doc: revolt
webpack and foreign-libs
bin scripts
* Environment
You can require pagora.aum.environment in both front and backend. The current evironment
is in the pagora.aum.environment/environment var or call functions like is-development? from that
namespace. The default environment is :dev. Start the app with
CLJ_ENV=[production|staging|testing] to change the environment.
* Config
Config is defined in multimethods like this:

#+BEGIN_SRC clojure
```clojure
(ns app.config)

(defmethod aum/config :common [_]
  {:timbre-log-level :error
   :app-path "app/"})

(defmethod aum/config :dev [_]
  {:timbre-level :info
   :frontend-config-keys [:app-path :timbre-level]})
```
#+END_SRC

Config keys need to be assigned scalar values (so no maps or vectors) so we can
set them in env vars on the command line.

You pass the namespaces these methods are defined to aum (app.config). Any
config defined in :common will be merged with config for the current environment
with the latter overriding keys in the former. This config is then used in aum
and can be requested from aum (aum.core/get-config).

Frontend config works the same way. Keys listed in the backend under
:frontend-config-keys will be sent to the frontend and merged into the frontend
config before the app starts.

* App starting process
** dev
*** Backend
When calling bin/dev-backend the last plugin (rebel) is configured in
resources/revold.edn under the :revolt.plugin/rebel.init-ns to load the clj.user
ns.
In clj.user a restart fn is defined that inits aum, inits a integrant system
with it and then calls (dev/go) on it. This kicks of all the init-key fns in the
various namespaces (db, server etc).
*** Frontend
When starting figwheel (by either bin/dev-figwheel or space-m-" in Emacs) the
compiler options in dev.cljs.edn get used to produce the js from cljs. The :main
options is set to cljs.user. This is the first file loaded in the frontend by
goog.require and all the dependent files are loaded after that. So cljs.user
should require app.frontend.core. This is enough to get the app going.

** prod
TODO-doc: explain how app starts in production
* Generic save records
When you have a page with records including their joins recursively you might
want to save the whole lot in one hit. aum calculates the actual
modifications, and only sends what's changed to the backend. The backend then
will save these records in the right order, taking into account newly created
records and any dependencies on them and will if anything went wrong with
updating a record return this info per record. It garantuees to leave the db in
a consistent and validated state and returns enough information so the frontend
can correct any optimistically updates to its own app state and make sure it's
stays in sync with the backend.
* Have backend return calculated data

  There are three ways to do this:

** Calculate something over a (sub)query
   Sometimes you want something to be calculated over a query and return not only
   the rows themselves, but also the extra data, such as total count. This is
   particularly tricky if you want to calculate something over a join. You want
   the joined rows, but also some more data over that particular subset of rows
   (joined as they are to the parent record).

   To do this add a :with-meta param key to the params of the query. Set this to a
   single keyword or map or a vector of them. If it's a map it should have at
   least a key :type, but you can then add more params for the calculation if you
   want.

   You can then extend the calc-meta-data multimethod from
   aum.parser.calc-meta-data in the backend which is dispatched on those
   :with-meta keys, or the :type value if it's a map. The method is called after
   the original sql query has been done. The sql-fn called, its args and
   calc-params as passed from the frontend.

   #+BEGIN_SRC clojure
  [{:group [({:user [:id :name]} {:with-meta [:count {:type :calc2 :some :params}]})]}]
  #+END_SRC

  #+BEGIN_SRC clojure
  (defmethod calc-meta-data :count
    [env rows {:keys [sql-fn sql-fn-args return-empty-vector? join-type calculation-params]}]
    ;;Do your calculation here
     )
  #+END_SRC

  One thing to take note of is that the return value for this query will be now of
  the form:

  #+BEGIN_SRC clojure
  {:rows [[:id 1 :name "foo"]] :meta {:count 123}}
  #+END_SRC

  Which means you will have to take this into account when this data arrives at
  your component, and/or when you implement the read method for the join with the
  :with-meta param.

** Define a read key in the backend

  Such as:

  #+BEGIN_SRC clojure
  (defmethod aum/read :calc/count
    [{:keys [user state parser query parser-config] :as env} _
     {:keys [table where] :as params}]
    ;;You can use the query to decide on what to calculate perhaps
    (timbre/info query) ;;=> [:count]
    {:value {:count (count-records env params)}})
  #+END_SRC

  Then add a query to a component:

  #+BEGIN_SRC clojure
  ({:calc/count [:count]} {:table :user
                           :where [:id :< 5]})
  #+END_SRC

  Disadvantage of this method is that you can only use this query as a root query
  or quasi root query. Also you have to possibly duplicate the params of this query in the
  frontend from another query. And this isn't useful for a joined query.

** Redirect a read to a custom-read
  Used search translations. Idea is to set a :custom-read key in the params of a
  query. Backend will use the read method as set to the :custom-read key and pass
  in the rest of params as well.

  Advantage of this is that you can redirect a query for a join to your own read
  method. Where you can then return a calculated value, any rows queried for
  and/or any other data you like.

  #+BEGIN_SRC clojure
  (defmethod aum/read :count-records
    [{:keys [user state parser query parser-config] :as env} _
     {:keys [table where] :as params}]
    {:value (count-records env params)})
  #+END_SRC

  With this query:

  #+BEGIN_SRC clojure
  '({:user-count [:count]} {:custom-read :count-records
                            :table :user
                            :where [:id :< 5]})
  #+END_SRC

