docs/aum/doc.md


<a id="org73e0430"></a>

### Run in production mode

TODO-aum: the build task doesn&rsquo;t include deps in aliases into the uberjar. Need to
fix the build task, so to create an uberjar uncomment the pagora.aum, pagora.revolt and
pagora.clj-utils deps in deps.edn.

Build production jar at dist/app.jar with:

bin/prod-build

This&rsquo;ll fetch node modules and build the js bundle as well.

Set db user/password/url/db-name, server port and ip, and what logs you would
like by setting the various environment variables and run jar (in dist dir):

TODO-aum: test starter app prod jar!!!
    CLJ<sub>ENV</sub>=prod DB<sub>USER</sub>=test DB<sub>PASSWORD</sub>=abc DB<sub>URL</sub>=&ldquo;*/localhost:3306*&rdquo; DB<sub>NAME</sub>=chinchilla<sub>development</sub> QUERY<sub>LOG</sub>=true SQL<sub>LOG</sub>=true HTTP<sub>LOG</sub>=false SERVER<sub>PORT</sub>=8081 SERVER<sub>IP</sub>=0.0.0.0 NEW<sub>RELIC</sub><sub>LICENSE</sub><sub>KEY</sub>=&ldquo;<some newrelic key>&rdquo; java -javaagent:./newrelic-agent.jar -Dnewrelic.config.file=./newrelic.yml   -Dnewrelic.environment=production -jar dist/aum.jarlk

or just

bin/prod-run

Or all in one cmd:

bin/prod-build-and-run

If tools.deps complains about dirs already existing when cloning repos delete ~/.gitlibs

Clearing classpath cache in ~/.clojure might also help.

See app at <http://localhost:8090>

Entry point of backend in production is at app.core (the -main fn).


<a id="org4fe6e9e"></a>

# Core concepts


<a id="org16e2935"></a>

## It&rsquo;s om-next.

The idea is to stay as close as possible to the original idea of om-next as just
a thin layer on the top of react, but extend some concepts so at the very least
a straightforward crud app can be built really simply and quickly, with simple
tools to facilitate both front and backends development.

Om-next itself is isomorphic, meaning it can ran on either front or backend. Aum
extends om-next, and some of it can be used on both front and backend, but in
general it focuses more on making om-next useful in a practical way. So in the
backend the om-next parser is implemented to query a mysql database, with
security and validation mechanisms.

On the frontend aum implements a parser that in most cases will do the
right thing in denormalizing queries over the app state. And there are mechanism
for dealing with multiple remotes, websockets, error handling, correcting
optimistic updates etc.

Aum has its own thin layers over the reconciler and parser but still uses defui,
om/transact! etc


<a id="orgd5788de"></a>

# Build system

TODO-doc: revolt
webpack and foreign-libs
bin scripts


<a id="orgf09d11d"></a>

# Environment

You can require pagora.aum.environment in both front and backend. The current evironment
is in the pagora.aum.environment/environment var or call functions like is-development? from that
namespace. The default environment is :dev. Start the app with
CLJ<sub>ENV</sub>=[production|staging|testing] to change the environment.


<a id="orgcca32f7"></a>

# Config

Config is defined in multimethods like this:

```clojure
    (ns app.config)
    
    (defmethod aum/config :common [_]
      {:timbre-log-level :error
       :app-path "app/"})
    
    (defmethod aum/config :dev [_]
      {:timbre-level :info
       :frontend-config-keys [:app-path :timbre-level]})
```

Config keys need to be assigned scalar values (so no maps or vectors) so we can
set them in env vars on the command line.

You pass the namespaces these methods are defined to aum (app.config). Any
config defined in :common will be merged with config for the current environment
with the latter overriding keys in the former. This config is then used in aum
and can be requested from aum (aum.core/get-config).

Frontend config works the same way. Keys listed in the backend under
:frontend-config-keys will be sent to the frontend and merged into the frontend
config before the app starts.


<a id="org0fa9fbc"></a>

# App starting process


<a id="org480cb3f"></a>

## dev


<a id="orgecd29c9"></a>

### Backend

When calling bin/dev-backend the last plugin (rebel) is configured in
resources/revold.edn under the :revolt.plugin/rebel.init-ns to load the clj.user
ns.
In clj.user a restart fn is defined that inits aum, inits a integrant system
with it and then calls (dev/go) on it. This kicks of all the init-key fns in the
various namespaces (db, server etc).


<a id="org604d6a2"></a>

### Frontend

When starting figwheel (by either bin/dev-figwheel or space-m-&ldquo; in Emacs) the
compiler options in dev.cljs.edn get used to produce the js from cljs. The :main
options is set to cljs.user. This is the first file loaded in the frontend by
goog.require and all the dependent files are loaded after that. So cljs.user
should require app.frontend.core. This is enough to get the app going.


<a id="org538b212"></a>

## prod

TODO-doc: explain how app starts in production


<a id="orged0fbfd"></a>

# Generic save records

When you have a page with records including their joins recursively you might
want to save the whole lot in one hit. aum calculates the actual
modifications, and only sends what&rsquo;s changed to the backend. The backend then
will save these records in the right order, taking into account newly created
records and any dependencies on them and will if anything went wrong with
updating a record return this info per record. It garantuees to leave the db in
a consistent and validated state and returns enough information so the frontend
can correct any optimistically updates to its own app state and make sure it&rsquo;s
stays in sync with the backend.
