docs/aum/doc.md


<a id="orgca2628e"></a>

### Intro

1.  Combining queries

    In om-next the root query is composed of sub queries recursively as they&rsquo;re
    pulled from components. However not every component necessarily represents a
    database row, or sequence of rows of a database table. Sometimes a component is
    just a grouping of other components. These components still need their own
    queries. A natural way of doing that is to use placeholder keys. Both front and
    backend parsers skip over these keys and just keep parsing and trying to return
    values for deeper lying keys instead. In the case of the backend if a key is not
    a table as set in the database config it will ignore it. In the frontend the
    parser just grabs the value of the key if it exists in the app state and keep
    parsing.

2.  Finetuning parser result

    In om-next for every render the complete root query is applied over the
    app-state (basically the same as the om-next function db->tree). This works fine
    for a small and simple app, however as an app gets more complicated you would
    like to have a bit more control of what gets returned for a key and/or if a key
    is included in any remote query. A standard om-next parser only implements
    reading the root query keys. In other words, it&rsquo;s not recursive. The aum
    parser recursively tries to interprete a query and will call any hooks for keys
    if they exist. So at any time during the parsing of a query you can insert your
    own code for resolving values and any remote. If you want to keep resolving any
    deeper lying queries you can call the supplied db->tree passed in the env
    (similar to how you received the parser in standard om-next).
    
    Standard om-next has something like dynamic queries. This extends this idea by
    letting you respond to app-state changes and changing what gets returned for any
    key anywhere in a query for both value and any remote. For instance you can set
    the selected-id in app state to 123 and in the query for your record in your
    &rsquo;selected-item&rsquo; component adding the right parameters to the query that goes to
    the backend. This should return the selected item once it&rsquo;s been fetched, but if
    you want you could customize that value as well, for example because you want to
    calculate a client side prop and add it to the value. Requesting and returning
    batches of items can be implemented similarly.


<a id="org1420a88"></a>

### Adding hooks for keys and joins in the root query for returning values and building remote query

1.  Principles

    The standard read method of aum is db->tree of om-next. This will return a
    tree of data by applying the root query over the app-state. The stock om-next
    db->tree fn has been extended in the following ways:
    
    1.  It&rsquo;s possible to define read methods for any key anywhere in the query. If
        you do you can then return anything you want for that key. You will get in
        the env the ast for the om-next expression (join or prop), the query if it&rsquo;s
        a join, context-data and (app-)state. Context data is the data relevant for
        the prop or join, which depends on where in the root query the key for the
        join or prop is. For instance the default way to resolve a prop is just to do
        (get context-data key). Default way to resolve a join is db->tree on the
        query and context-data (see aum.reconciler.parser.key.route and the read
        method for [:value :route/\*]).
    
    2.  The db->tree fn has been modified so that it instead of returning data it&rsquo;ll
        return the query again, but &rsquo;sparsified&rsquo; when :sparsify-query? flag is set.
        By default if any data is found that part of the query is elided. But again
        you can add read methods to determine yourself if and what should be included
        for any key in the root query. In standard om you need to return a (possibly
        modified) ast. For these aum read methods to work you return a (modified)
        query instead. Whatever you return will be included in the remote query. If
        you want to process and modify the ast you can you just do a (om/ast->query
        ast) when you&rsquo;re done editing it. You can also return true which will then
        result in the query being parsed further the standard db->tree way. Note that
        currently if the key is a prop only the truthiness of the return value is
        used. If truthy the return key is included, otherwise it isn&rsquo;t. Return the
        full query in case of a join. So for a read method for [:aum :foo] you
        return {:foo [:some :query]}. If query had params you can add them again,
        possibly modified.
    
    3.  Read method is dispatched on key, or on [target key]. Second one takes
        preference over first. In the first instance you need to return a map such as
        {:value :some-value :aum {:some-key [:some :query]}} similar to standard
        om-next read methods.

2.  Examples

    1.  VALUE example
    
        The method (note the :value in the dispatch vector):
        
            (defmethod aum/read [:value :bar] [{:keys [query context-data] :as env} key params] ...)
        
        for a app state structure like this:
        
            {:foo {:bar {:k1 1 :k2 2}}}
        
        and a root query of:
        
            [{:foo [{:bar [:k1 :k2 :k3]}]}]
        
        receives env like this:
        
            {:query [:k1 :2]
             :context-data {:k1 1 :k2 2}
             :ast {:type :join, :dispatch-key :bar, :key :bar, :query [:k1 :k2],
                   :children [{:type :prop, :dispatch-key :k1, :key :k1} {:type :prop, :dispatch-key :k2, :key :k2}]}
             ...
            }
        
        and should return for example this:
        
            {:k1 1 :k2 2}
    
    2.  REMOTE example
    
        The method (note the :aum in the dispatch vector):
        
            (defmethod aum/read [:aum :bar] [{:keys [query context-data] :as env} key params] ...)
        
        for a app state structure like this:
        
            {:foo {:bar {:k1 1 :k2 2}}}
        
        and a root query of:
        
            [{:foo [{:bar [:k1 :k2 :k3]}]}]
        
        receives env like this:
        
            {:query [:k1 :k2 :k3]
             :context-data {:k1 1 :k2 2}
             :ast {:type :join, :dispatch-key :bar, :key :bar, :query [:k1 :k2],
                   :children [{:type :prop, :dispatch-key :k1, :key :k1} {:type :prop, :dispatch-key :k2, :key :k2}]}
             ...
            }
        
        and should return for example this:
        
            {:bar [:k3]}
        
        to create a remote query like this:
        
            [{:foo [{:bar [:k3]}]}]
        
        If you want to keep the params (or add, or modify) return something like this:
        
            (cond-> {:bar [:k3]}
              (some? params (list params)
    
    3.  Routing
    
        Sometimes you would like to only load (send with the remote) a particular
        segment of a root query, for instance based on route of page that the user
        selected to display. By setting the selected page in app state you can (by using
        key inheritance and multimethods) only return a remote for a key that matches
        that page:
        
            (defmethod aum/read [:value :page/*]
              [{:keys [state default-remote context-data query db->tree] :as env} page params]
              (let [current-page (:app/page @state)]
                (when (= current-page page)
                  (db->tree env {:query query
                                 :data  context-data
                                 :refs  @state}))))
            
            (defmethod aum/read [:remote :page/*]
              [{:keys [state] :as env} page params]
              (let [current-page (:app/page @state)]
                (= current-page page)))
            
              (doseq [page [:page/some-page :page/some-other-page]]
                (aum/derive-om-query-key! page :page/*))
        
        This implements basic &rsquo;routing&rsquo;.
        
        This is
    
    4.  Pagination
