docs/aum/doc.md
    
        Set the query for the items you want to display paginated (or with infinite
        scroll) in the relevant component. This will by default fetch all available
        records (or as many as the server is willing to send in one batch). This is not
        what we want so we add a hook for the query for that component. In that query we
        add the proper params (such as limit, offset etc). These values will (should)
        have been set in app state with a mutation (triggered by a scroll or click of
        pagination button). Now only the records for a particular page are fetched. If
        we are paginating this is enough. If we are scrolling we need to &rsquo;cache&rsquo; the
        list of idents already in place for our key from a previous query. Then on read
        of that key we need to prefix the cached list of idents to the actual list of
        idents received from the backend.
    
    5.  Autocomplete
    
        Add a hook for the key for the autocomplete component. Return nil for any remote
        and it will not be added to the root remote query Once a search term is set in
        app state we adjust the query for the autocomplete component and add the right
        params (eg. {:where [:name :like &ldquo;%my search%&rdquo;]}). This will make data avaliable
        for the autocomplete component to display in its dropdown. This search term in
        app state will have to cleared when navigating away from the page otherwise it
        will be acted on again when returning to the page with the autocomplete.

3.  Notes

    -   If you set ignore-hooks? to true db->tree will function as the standard om-next
    
    db->tree, but by setting :sparsify-query? to true you can still also calculate
    the remote query.
    
    -   In aum.reconciler.parser.denormalize there&rsquo;s a comment block where you can
    
    play around with db->tree. There&rsquo;s also the try-frontend-read ns.
    
    -   To see the whole process in all its glory set timbre-level to :debug in
    
    app.config.cljs and set the chrome dev console to verbose output.
    
    \_ For read methods the parser is not available in the env, but db->tree is.
    
    Use of that is simple:
    
             (db->tree env {:query query ;;Apply this query
                            :data  data ;;to this data
                            :refs  app-data ;;looking up idents (refs) here.
                            :sparsify-query? false ;;Return the data, not a sparsified query
                            :ignore-hooks? false
        })


<a id="org08c33e1"></a>

## Garbage collection

There is currently no garbage collecting implemented. As with any garbage
collection the criteria for this are rather app and platform specific. But in
principle you will only have to delete any data from app state and if the ui
gets in a state where it requires that data it will just be added to any remote
query again.

A history of all app-state is kept, this is limited to 100 by default. This
could be reduced. On page change you could just wipe any idents referred to
by that page.


<a id="orgfe70b0c"></a>

## Internationalization

There is a common.i18n.cljc namespace which provides the translate fn which
takes the current locale as passed into components as a computed property and a
key.


<a id="org5efd421"></a>

## Post remote

Sometimes you would like to a take some extra action <span class="underline">after</span> a remote mutation has
finished and the data has been returned. For every mutation method you can
define a same name post-remote method. This is called with the value as returned
from the backend. Here you can do error handling for instance or &rsquo;clean up&rsquo; the
response before it get merged with app state.


<a id="org5d93ee7"></a>

## Pre-merge hooks

These hooks allow you to take action before <span class="underline">any</span> value gets merged with
app-state, including responses to read queries.


<a id="orgf1b5913"></a>

## Merging pushed data

Backend can use websockets for resolving queries from the frontend, but this
means it&rsquo;s also possible to &rsquo;push&rsquo; data. The frontend can  respond to this and
merge this as any regular response to a query. This is useful to keep instances
of the app in sync, but also to show notifications, or to push a response of a
query in an async manner. It can be sent to the frontend if and whenever the
required data is available.


<a id="org4c022d0"></a>

## Generic undo/redo/revert.

Every mutation on a record adjust some metadata on the record that enables
undo/redo/revert for that record. This also includes any data joined to that
record, they will also get undone/redone/reverted.


<a id="org926eba5"></a>

## Run backend in frontend (for testing for example)

It is possible to run the whole backend in the frontend where the mysql database
is &rsquo;mocked&rsquo; in the frontend. This is ideal for writing integration tests
covering the whole stack


<a id="orga6e5d53"></a>

## Test runner

Standalone client-side om-next test-runner app to be used with the
alternative test macros that add and remove tests to the lists of tests. Several
ways to display diffs. Rerun test on click. Use snapshots for any test instead
of writing the required result into the test. Helpers to click and compare html
output for acceptance ui tests. Replay/rewind/step through (ui) tests by using
pause macro.


<a id="orgca42ee9"></a>

## Snapshot testing

There are facilities to create a test by putting it together step by step and
instead inserting expected results take snapshots and use them instead. This is
particularly handy for testing states of the ui. It&rsquo;s also then possible to step
through the test in the test runner. If any intermediate snapshot fails the test
but (because we updated the code for example) is what we do expect we can update
the snapshot by clicking a button.


<a id="org90464b7"></a>

## Whole stack testing

By combining test runner, snapshot testing and running backend in frontend it&rsquo;s
possible to do whole stack testing.


<a id="org6be0b67"></a>

## Inspector

Search, filter and drill into app state.


<a id="org279a68f"></a>

## Dev-cards

Switch to dev cards page from app itself.


<a id="org1035e35"></a>

# Testing

First install nvm (node version manager).

Then

nvm install
nvm use
npm install
npm install -g karma-cli

TODO


<a id="orgc812736"></a>

# Debug production/staging

It&rsquo;s possible to set some flags in local storage to get some output in console
etc:

Set log level:

:timbre-level :info

Click on AUM logo and some debug buttons will show up:

:debug-drawer true

Show what query is sent and what is returned:

:send true

Show item id in lists:

:display-item-id true

Show debug buttons in page bar:

:debug-buttons true

In boot-scripts there&rsquo;s tail.boot to inspect logstash output:

boot boot-scripts/tail.boot -h

Options:
  -h, &#x2013;help        Print this help info.
  -f, &#x2013;follow      follow
  -s, &#x2013;start VAL   VAL sets start (line number or time (hh:mm) such as &ldquo;11:10&rdquo;).
  -n, &#x2013;length VAL  VAL sets number of lines or length of time such as &ldquo;10h&rdquo;, &ldquo;5m&rdquo; &ldquo;50s&rdquo; If start is given then last so many lines or within last so much time.
  -t, &#x2013;http-log    print http output lines
  -i, &#x2013;timestamp   print timestamps
  -r, &#x2013;regex VAL   VAL sets regex to filter lines.
  -l, &#x2013;level VAL   VAL sets level to filter such as info or error.


<a id="orga67d060"></a>

# Misc


<a id="org19e36c9"></a>

## Querying other sources than a mysql database


<a id="orgee528c3"></a>

### Using more than one remote in the frontend


<a id="org416f63d"></a>

### Returning data fetched from another source asynchronously

If a backend query can&rsquo;t be resolved and returned synchronously it&rsquo;s possible to
push the result to the frontend when it&rsquo;s available.
