docs/aum/doc.md


<a id="orgacb9f79"></a>

# config

-   when running bin/dev or boot dev in the dev-task there is
     (environ :env {:clj-env &ldquo;dev&rdquo;})
    This sets an env var which is picked up in app.environment. app.environment
    defines a fn that returns current environment. Which is called in app.config
    to decide on which config (dev-config, prod-config, staging-config or
    test-config) is used to build app.config/config var. The various configs have
    for ease of use a :clj-env key naming for what environment the config is for.
    
    As explained in the app.config ns itself, any env variable set on command line
    or set in profile.boot (using environ lib) will override any hardcoded setting
    in app.config. For this reason any keys in any config map will have to be
    scalar values. Because bash env vars are scalar values (numbers, strings etc).
    
    Of course when config map actually gets defined it&rsquo;s possible to build up
    submaps to be used in the app.
    
    When starting up a jar (eg bin/test-prod-jar) you will need to set the clj-env
    environment variable. There&rsquo;s a (environ :env {:clj-env &ldquo;prod&rdquo;}) in the build
    task, but this has only effect on the build. Not the running of the program
    (when running the jar).
    
    Require app.config if you need settings [app.config :refer [config]]. However
    in om parser read and mutate methods the config is part of the env param
    passed in as :parser-config. Better to use that so it can be more easily
    mocked in tests.
    
    At top of app.config ns there is env-keys defined. This is a set of all
    settings that can be overridden/set on the commandline or profile.boot.


<a id="org6f99536"></a>

# (sql) validation

Every call to the sql fn in the database.query ns by default is validated by
calling the aum validate-sql-fn multimethod. This dispatches on sql fn
keyword. For all mutating sql queries as defined in the aum.database.queries
ns the proper validation fn is retrieved using security/get-validation-fun.
This can be set in the database.config but if not the multimethod
aum.database.validate.core/validate multimethod is called, dispatching on
role of the user, method (sql fn keyword) and table.

Idea is that for every hugsql fn added you will have to write a validate-sql-fun
 method otherwise it will just throw an exception when its called through
 database.query/sql. You can write an empty method, and then no validation is
 done. You can do validation right there and then, or you can retrieve an
 appropriate validation fn by calling security/get-validation-fun. You will
 probably wil have to add a fn to database.config or add an appropriate
 aum.database.validate.core/validate method. Otherwise, again, an exception is
 thrown by default.


<a id="org57689f1"></a>

# sql process-params, process-result

In essence all the database.query/sql fn does is first call
aum-process-params, then process-params on the params, call validate-sql then
call the actual hugsql fn and then call aum-process-result and then
process-params on the result.

aum-process-params does some built-in params processing, same for
aum-process-result. Custom versions of these fns will be used if set in the
sql prop of env.

process-params does nothing by default, process-result just returns result as
passed in.

aum.database.queries ns is used to resolve the hugsql fn

It&rsquo;s also possible to add an extra hugsql ns for resolving the sql fn.
(aum-)process-params, (aum-)process-result and validate-sql-fun are all
multimethods so you can add methods to deal with any extra hugsql fns.

process-params (and process-result) is handy for adding hooks. For instance for
the event-store. For more detail see also doc string of database.query/sql fn.


<a id="org15f5483"></a>

# Read permissions and create/update/delete permissions, and validations of om-queries

These are set in database.config namespace.


<a id="orge92076a"></a>

# frontend testing

-   Run
    npm install

in aum dir

-   Run
    npm install -g karma-cli

Browser in memory sql options:
<https://github.com/kripken/sql.js>
<https://github.com/agershun/alasql/wiki/Getting%20started>

parser.core is now a cljc file, including all its deps


<a id="orga1f2b4e"></a>

# Deciding on selected group

The app can be in a state where a group is &rsquo;selected&rsquo;. In this state certain
pages (like users, translations) will manage records only from/for the selected
group. Some pages are immuun ie, they behave the same regardless of selected
group, like groups page itself, or job offers, or support questions. Other pages
only can only edit records of a particular group, like dossier types, pdf
options.

By default a selected group is the current user&rsquo;s group. But it can also be
set/derived from local/session storage (or from any state in the url
(unimplemented as of 7/18)). The app can be in a state of &rsquo;all groups&rsquo; by
setting selected group-id to -1 or nil.

Complication is that on refresh, while we&rsquo;re logged in, we don&rsquo;t know what the
current user&rsquo;s group is since we don&rsquo;t have that info yet. One
massive query goes to the backend asking for the current user&rsquo;s data, and any other
data required for the current page. Solution for this is not to ask for any
specific group-id number, but for a property on the current user, so for
u/group-id in this case.

The backend resolves what user is actually making the massive initial query
before parsing the actual query itself. (This enables role based access, scoping
etc) The user is passed into the query parser, and any params that are
namespaced keywords are resolved against the user&rsquo;s map first.

We need to weave this variable group-id into the queries that go to the backend.
We&rsquo;re not using om-next dynamic queries at all, but instead give parameters to
query keys that are picked by the cljs query parser. These parameters are like
{:params :selected-group} for instance. The parser goes and looks for the
:selected-group entry in the :params value of the config for the current page.
This can be a map, in which case this is used as the params map for the key in
the query, or a fn. This fn is called with app-state and the result is used as
the params for query key.

All this is not very standardized actually, and there&rsquo;s parallel mechanisms
currently. We have one for batch queries: :batch-params and one for single
record queries: :params. Under a table entry for a page-config we have similar
entries for deciding on what remote keys to send (:selected-remote-keys and :batch-remote-keys).

In any case, initial group-id is set in reconciler.app-state, per page, where
it&rsquo;s usually set to whatever is :selected-group in storage, or if that&rsquo;s
desirable, u/group-id, meaning the user&rsquo;s group-id.


<a id="org3f0f56a"></a>

# Trying queries

In the dev source folder there are namespaces to try out various queries:


<a id="orgf8d103a"></a>

## try-om-query

You can call the backend parser with any om-next query. These are resolved
against the database as defined in app.config and using database.config as
defined for the whole app.

There is a second version where you can build your own parser environment and
your own parser with that again.


<a id="org85cd89d"></a>

## Try sql query

To try out any sql query. Make sure to define process-params, validate-sql-fn
and process-result methods, and the equivalent sql fun in build-sql if you want
it to be used in mock mode or tests.


<a id="org0900db2"></a>

## Try/test frontend parser.

Frontend parser is a cljc file so you can eval this in a clojure repl. You can
test here what the parser returns for queries for the nil and various remote
targets, which is much harder to test/inspect if you have to use the ui to pass
queries to the parser.


<a id="org7d81c71"></a>

# Start aum with different ports and db:

DB<sub>NAME</sub>=chin<sub>dev</sub><sub>minimal</sub> SERVER<sub>PORT</sub>=9080 NREPL<sub>PORT</sub>=38401 RELOAD<sub>PORT</sub>=46501 bin/dev
