docs/aum/doc.org
* pathopt
  https://awkay.github.io/om-tutorial/#!/om_tutorial.I_Path_Optimization
  Path Optimization
As your UI grows you may see warnings in the Javascript Console about slowness.
If you do, you can leverage path optimization to minimize the amount of work the
parser has to do in order to update a sub-portion of the UI.

If you pass :pathopt true to the reconciler, then when re-rendering a component
that has an Ident Om will attempt to run the query starting from that component
(using it's Ident as the root of the query). If your parser returns a result, it
will use it. If your parser returns nil then it will focus the root query to
that component and run it from root.

When it attempts this kind of read it will call your read function with
:query-root set to the ident of the component that is needing re-render, and you
will need to follow the query down from there. Fortunately, db->tree still works
for the default database format with a little care.

So om-next calls the parser, but the query will be a (focussed on the cmp) query
against the root of app-data. If you set pathopt to true and a cmp has an ident
and a query it will call the parser with the :query-root key of env to the
ident, and query to the query of the cmp, so the parser can work a bit faster.
Which I do in my parser read* fn

* Adding hooks for keys and joins in the root query for returning values and building remote query
** Principles
The standard read method of aum is db->tree of om-next. This will return a
tree of data by applying the root query over the app-state. The stock om-next
db->tree fn has been extended in the following ways:

1. It's possible to define read methods for any key anywhere in the query. If
   you do you can then return anything you want for that key. You will get in
   the env the ast for the om-next expression (join or prop), the query if it's
   a join, context-data and (app-)state. Context data is the data relevant for
   the prop or join, which depends on where in the root query the key for the
   join or prop is. For instance the default way to resolve a prop is just to do
   (get context-data key). Default way to resolve a join is db->tree on the
   query and context-data (see aum.reconciler.parser.key.route and the read
   method for [:value :route/*]).

2. The db->tree fn has been modified so that it instead of returning data it'll
   return the query again, but 'sparsified' when :sparsify-query? flag is set.
   By default if any data is found that part of the query is elided. But again
   you can add read methods to determine yourself if and what should be included
   for any key in the root query. In standard om you need to return a (possibly
   modified) ast. For these aum read methods to work you return a (modified)
   query instead. Whatever you return will be included in the remote query. If
   you want to process and modify the ast you can you just do a (om/ast->query
   ast) when you're done editing it. You can also return true which will then
   result in the query being parsed further the standard db->tree way. Note that
   currently if the key is a prop only the truthiness of the return value is
   used. If truthy the return key is included, otherwise it isn't. Return the
   full query in case of a join. So for a read method for [:aum :foo] you
   return {:foo [:some :query]}. If query had params you can add them again,
   possibly modified.

3. Read method is dispatched on key, or on [target key]. Second one takes
   preference over first. In the first instance you need to return a map such as
   {:value :some-value :aum {:some-key [:some :query]}} similar to standard
   om-next read methods.

** Examples
*** VALUE example
The method (note the :value in the dispatch vector):

#+BEGIN_SRC clojure
(defmethod aum/read [:value :bar] [{:keys [query context-data] :as env} key params] ...)
#+END_SRC

for a app state structure like this:

#+BEGIN_SRC clojure
{:foo {:bar {:k1 1 :k2 2}}}
#+END_SRC

and a root query of:

#+BEGIN_SRC clojure
[{:foo [{:bar [:k1 :k2 :k3]}]}]
#+END_SRC

receives env like this:

#+BEGIN_SRC clojure
{:query [:k1 :2]
 :context-data {:k1 1 :k2 2}
 :ast {:type :join, :dispatch-key :bar, :key :bar, :query [:k1 :k2],
       :children [{:type :prop, :dispatch-key :k1, :key :k1} {:type :prop, :dispatch-key :k2, :key :k2}]}
 ...
}
#+END_SRC

and should return for example this:

#+BEGIN_SRC clojure
{:k1 1 :k2 2}
#+END_SRC

*** REMOTE example
The method (note the :aum in the dispatch vector):

#+BEGIN_SRC clojure
(defmethod aum/read [:aum :bar] [{:keys [query context-data] :as env} key params] ...)
#+END_SRC

for a app state structure like this:

#+BEGIN_SRC clojure
{:foo {:bar {:k1 1 :k2 2}}}
#+END_SRC

and a root query of:

#+BEGIN_SRC clojure
[{:foo [{:bar [:k1 :k2 :k3]}]}]
#+END_SRC

receives env like this:

#+BEGIN_SRC clojure
{:query [:k1 :k2 :k3]
 :context-data {:k1 1 :k2 2}
 :ast {:type :join, :dispatch-key :bar, :key :bar, :query [:k1 :k2],
       :children [{:type :prop, :dispatch-key :k1, :key :k1} {:type :prop, :dispatch-key :k2, :key :k2}]}
 ...
}
#+END_SRC

and should return for example this:

#+BEGIN_SRC clojure
{:bar [:k3]}
#+END_SRC

to create a remote query like this:

#+BEGIN_SRC clojure
[{:foo [{:bar [:k3]}]}]
#+END_SRC

If you want to keep the params (or add, or modify) return something like this:

#+BEGIN_SRC clojure
(cond-> {:bar [:k3]}
  (some? params (list params)
#+END_SRC


** Notes
- If you set ignore-hooks? to true db->tree will function as the standard om-next
db->tree, but by setting :sparsify-query? to true you can still also calculate
the remote query.

- In aum.reconciler.parser.denormalize there's a comment block where you can
play around with db->tree. There's also the try-frontend-read ns.

- To see the whole process in all its glory set timbre-level to :debug in
app.config.cljs and set the chrome dev console to verbose output.

_ For read methods the parser is not available in the env, but db->tree is.

Use of that is simple:

#+BEGIN_SRC clojure
     (db->tree env {:query query ;;Apply this query
                    :data  data ;;to this data
                    :refs  app-data ;;looking up idents (refs) here.
                    :sparsify-query? false ;;Return the data, not a sparsified query
                    :ignore-hooks? false
})
#+END_SRC


* Have backend return calculated data

There are three ways to do this:

